trade/src/Documents/ПроизводственнаяОперацияВЕТИС/ПроизводственнаяОперацияВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводственнаяОперацияВЕТИС</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>InformationRegister.ЗаписиСкладскогоЖурналаВРезервеВЕТИС</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеПроизводственнаяОперацияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйствующийСубъект</name>
    <type>
      <types>CatalogRef.ХозяйствующиеСубъектыВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Предприятие</name>
    <type>
      <types>CatalogRef.ПредприятияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговыйОбъект</name>
    <type>
      <types>DefinedType.ТорговыйОбъектВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>DefinedType.ПользователиИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПроизводственнойТранзакции</name>
    <type>
      <types>DefinedType.ИдентификаторПроизводственнойТранзакцииВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершениеПроизводственнойТранзакции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.ПродукцияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатурыВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВЕТИС</name>
      <type>
        <types>DefinedType.КоличествоВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВЕТИС</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмеренияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводстваСтрока</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводстваТочностьЗаполнения</name>
      <type>
        <types>EnumRef.ТочностьЗаполненияПериодаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводстваНачалоПериода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводстваКонецПериода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодностиСтрока</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодностиТочностьЗаполнения</name>
      <type>
        <types>EnumRef.ТочностьЗаполненияПериодаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодностиНачалоПериода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодностиКонецПериода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СкоропортящаясяПродукция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НизкокачественнаяПродукция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭкспертизаВыполнена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭкспертизаРезультат</name>
      <type>
        <types>EnumRef.РезультатыЛабораторныхИсследованийВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсобыеОтметки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаписьСкладскогоЖурнала</name>
      <type>
        <types>CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ВетеринарноСопроводительныйДокумент</name>
      <type>
        <types>CatalogRef.ВетеринарноСопроводительныйДокументВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПартии</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сырье</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.ПродукцияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатурыВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВЕТИС</name>
      <type>
        <types>DefinedType.КоличествоВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВЕТИС</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмеренияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаписьСкладскогоЖурнала</name>
      <type>
        <types>CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаписьСкладскогоЖурналаАрхив</name>
      <type>
        <types>CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УпаковкиВЕТИС</name>
    <attributes>
      <name>ИдентификаторСтрокиТовары</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньУпаковки</name>
      <type>
        <types>EnumRef.УровниУпаковокВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковкаВЕТИС</name>
      <type>
        <types>CatalogRef.УпаковкиВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокВЕТИС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМаркировки</name>
      <type>
        <types>EnumRef.ТипыМаркировкиУпаковокВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическийПроцесс</name>
    <attributes>
      <name>ТипОперации</name>
      <type>
        <types>EnumRef.ТипыПроизводственныхОперацийВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперацииНачалоПериода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперацииКонецПериода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade/src/InformationRegisters/СтатусыДокументовВЕТИС/СтатусыДокументовВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыДокументовВЕТИС</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбработкиОбъединенийЗаписейСкладскогоЖурналаВЕТИС</types>
      <types>EnumRef.СтатусыОбработкиЗапросовСкладскогоЖурналаВЕТИС</types>
      <types>EnumRef.СтатусыОбработкиИнвентаризацийПродукцииВЕТИС</types>
      <types>EnumRef.СтатусыОбработкиПроизводственныхОперацийВЕТИС</types>
      <types>EnumRef.СтатусыОбработкиВходящихТранспортныхОперацийВЕТИС</types>
      <types>EnumRef.СтатусыОбработкиИсходящихТранспортныхОперацийВЕТИС</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие1</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюВЕТИС</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие2</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюВЕТИС</types>
    </type>
  </resources>
  <resources>
    <name>ДальнейшееДействие3</name>
    <type>
      <types>EnumRef.ДальнейшиеДействияПоВзаимодействиюВЕТИС</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументыВЕТИС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

trade/src/Catalogs/ПродукцияВЕТИС/ПродукцияВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПродукцияВЕТИС</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ЖивыеЖивотные</name>
      <description>Живые животные</description>
    </items>
    <items>
      <name>КормаИКормовыеДобавки</name>
      <description>Корма и кормовые добавки</description>
    </items>
    <items>
      <name>ЛекарственныеСредства</name>
      <description>Лекарственные средства</description>
    </items>
    <items>
      <name>МясоИМясопродукты</name>
      <description>Мясо и мясопродукты</description>
    </items>
    <items>
      <name>НепищевыеПродуктыИДругое</name>
      <description>Непищевые продукты и другое</description>
    </items>
    <items>
      <name>ПищевыеПродукты</name>
      <description>Пищевые продукты</description>
    </items>
    <items>
      <name>ПродукцияНеТребующаяРазрешения</name>
      <description>Продукция не требующая разрешения</description>
    </items>
    <items>
      <name>РыбаИМорепродукты</name>
      <description>Рыба и морепродукты</description>
    </items>
  </predefined>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВерсии</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВерсионныхОбъектовВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПродукции</name>
    <type>
      <types>CatalogRef.ПродукцияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.ПродукцияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>CatalogRef.ПродукцияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетГОСТ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГОСТ</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>GTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ФасовкаУпаковка</name>
    <type>
      <types>CatalogRef.УпаковкиВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФасовкаКоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФасовкаЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмеренияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФасовкаКоличествоЕдиницВУпаковке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйствующийСубъектПроизводитель</name>
    <type>
      <types>CatalogRef.ХозяйствующиеСубъектыВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйствующийСубъектПроизводительИдентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйствующийСубъектСобственникТорговойМаркиИдентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Произвольная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Производители</name>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.ПредприятияВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade/src/Documents/ПроизводственнаяОперацияВЕТИС/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнтеграцияВЕТИСПереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	
	МассивПродукции = Товары.Выгрузить(,"Продукция").ВыгрузитьКолонку("Продукция");
	СоответствиеТипЖивыеЖивотные = ИнтеграцияВЕТИСВызовСервера.ПродукцияПринадлежитТипуЖивыеЖивотные(МассивПродукции);
	Для каждого СтрокаТабличнойЧасти Из Товары Цикл
		Если СоответствиеТипЖивыеЖивотные[СтрокаТабличнойЧасти.Продукция] = Истина Тогда
			ИнтеграцияВЕТИСКлиентСервер.СброситьЗначенияПоСтрокеСЖивымиЖивотными(СтрокаТабличнойЧасти);
		КонецЕсли;
	КонецЦикла;
	
	Документы.ПроизводственнаяОперацияВЕТИС.ЗаполнитьДанныеЭкспертизыПоСтатистикеПользователя(ЭтотОбъект);
	Документы.ПроизводственнаяОперацияВЕТИС.ЗаполнитьСрокиГодностиПоСтатистикеПродукции(ЭтотОбъект);
	Документы.ПроизводственнаяОперацияВЕТИС.ЗаполнитьУпаковкиПоСтатистикеПродукции(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа
	ИнтеграцияИС.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.ПроизводственнаяОперацияВЕТИС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ИнтеграцияИС.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ИнтеграцияИСПереопределяемый.ОтразитьДвиженияСерийТоваров(ДополнительныеСвойства, Движения, Отказ);
	ИнтеграцияВЕТИС.ЗагрузитьТаблицыДвижений(ДополнительныеСвойства, Движения, "ДвиженияСерийТоваров");
	
	ИнтеграцияИС.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ИнтеграцияИСПереопределяемый.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
	ИнтеграцияИС.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ВыполнятьПроверкиРеквизитовВетИС = Истина;
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ТекущееСостояние = РегистрыСведений.СтатусыДокументовВЕТИС.ТекущееСостояние(Ссылка);
		КонечныеСтатусы = Документы.ПроизводственнаяОперацияВЕТИС.КонечныеСтатусы(Ложь);
		Если КонечныеСтатусы.Найти(ТекущееСостояние.Статус) <> Неопределено Тогда
			ВыполнятьПроверкиРеквизитовВетИС = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если ВыполнятьПроверкиРеквизитовВетИС Тогда
		
		ПроверитьЗаполнениеТабличнойЧастиТовары(Отказ);
		
		ПроверитьСоответствиеПродукцииСырья(Отказ);
		
		ПроверитьЗаполнениеТабличнойЧастиТехнологическийПроцесс(Отказ);
		
		Если Товары.Итог("КоличествоВЕТИС") = 0
			И Сырье.Итог("КоличествоВЕТИС") = 0
			И Не ЗавершениеПроизводственнойТранзакции Тогда
			
			ТекстСообщения = НСтр("ru = 'Количество продукции и сырья нулевое, нет данных для передачи.'");
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,,,
				Отказ);
			
		КонецЕсли;
		
	Иначе
		
		МассивНепроверяемыхРеквизитов.Добавить("Товары.ИдентификаторПартии");
		МассивНепроверяемыхРеквизитов.Добавить("Сырье.КоличествоВЕТИС");
		
	КонецЕсли;
	
	ИнтеграцияВЕТИСПереопределяемый.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(Идентификатор) Тогда
		Идентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ИнтеграцияВЕТИС.ЗаписатьСоответствиеНоменклатуры(ЭтотОбъект, РежимЗаписи);
	ИнтеграцияВЕТИС.ЗаписатьСоответствиеНоменклатуры(ЭтотОбъект, РежимЗаписи, "Сырье");
	
	ИнтеграцияВЕТИС.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияВЕТИС.ЗаписатьСтатусДокументаВЕТИСПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Неопределено;
	Идентификатор     = "";
	
	Если Товары.Количество() > 0 Тогда
		Товары.ЗагрузитьКолонку(Новый Массив(Товары.Количество()), "ЗаписьСкладскогоЖурнала");
		Товары.ЗагрузитьКолонку(Новый Массив(Товары.Количество()), "ВетеринарноСопроводительныйДокумент");
		
		ПереносИдентификаторовСтрок = Новый Соответствие;
		Для Каждого СтрокаТовары Из Товары Цикл
			Ид = Строка(Новый УникальныйИдентификатор);
			ПереносИдентификаторовСтрок.Вставить(СтрокаТовары.ИдентификаторСтроки, Ид);
			СтрокаТовары.ИдентификаторСтроки = Ид;
		КонецЦикла;
		Для Каждого СтрокаУпаковка Из УпаковкиВЕТИС Цикл
			СтрокаУпаковка.ИдентификаторСтрокиТовары = ПереносИдентификаторовСтрок.Получить(СтрокаУпаковка.ИдентификаторСтрокиТовары);
		КонецЦикла;
		
	КонецЕсли;
	
	Если Сырье.Количество() > 0 Тогда
		Сырье.ЗагрузитьКолонку(Новый Массив(Сырье.Количество()), "ЗаписьСкладскогоЖурнала");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(Отказ)
	
	ЗаполнениеДокументовВЕТИС.ПроверитьЗаполнениеДатыПроизводстваСрокаГодности(ЭтотОбъект, "Товары", Отказ);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеТабличнойЧастиТехнологическийПроцесс(Отказ)
	
	ШаблонСообщения = НСтр("ru = 'Дата окончания операции не должна быть меньше даты начала (строка %1, список ""Технологический процесс"")'");
	
	Для каждого Строка Из ТехнологическийПроцесс Цикл
		Если ЗначениеЗаполнено(Строка.ДатаОперацииНачалоПериода)
			И ЗначениеЗаполнено(Строка.ДатаОперацииКонецПериода)
			И Строка.ДатаОперацииНачалоПериода > Строка.ДатаОперацииКонецПериода Тогда
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ТехнологическийПроцесс", Строка.НомерСтроки, "ДатаОперацииКонецПериода");
			
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(ШаблонСообщения, Строка.НомерСтроки),
				ЭтотОбъект, 
				Поле,,
				Отказ);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСоответствиеПродукцииСырья(Отказ)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Т.Продукция КАК Продукция,
	|	Т.Сырье КАК Сырье
	|ПОМЕСТИТЬ ВТТаблицаСоответствия
	|ИЗ
	|	&ТаблицаСоответствия КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.НомерСтроки КАК НомерСтроки,
	|	Т.Продукция КАК Продукция
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	&Товары КАК Т
	|ГДЕ
	|	НЕ Т.Продукция = ЗНАЧЕНИЕ(Справочник.ПродукцияВЕТИС.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПродукцияВЕТИС.ТипПродукции КАК ТипПродукции,
	|	ПродукцияВЕТИС.ВидПродукции КАК ВидПродукции
	|ПОМЕСТИТЬ ВТСырье
	|ИЗ
	|	Справочник.ПродукцияВЕТИС КАК ПродукцияВЕТИС
	|ГДЕ
	|	ПродукцияВЕТИС.Ссылка В(&Сырье)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТТовары.НомерСтроки КАК НомерСтроки,
	|	ПродукцияВЕТИС.ТипПродукции.Представление КАК ТипПродукцииПредставление,
	|	ВТСырье.ТипПродукции.Представление КАК ТипСырьяПредставление
	|ИЗ
	|	ВТТовары КАК ВТТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСырье КАК ВТСырье
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПродукцияВЕТИС КАК ПродукцияВЕТИС
	|		ПО ВТТовары.Продукция = ПродукцияВЕТИС.Ссылка
	|ГДЕ
	|	НЕ((ПродукцияВЕТИС.ТипПродукции, ВТСырье.ТипПродукции) В
	|					(ВЫБРАТЬ
	|						ВТТаблицаСоответствия.Продукция КАК Продукция,
	|						ВТТаблицаСоответствия.Сырье КАК Сырье
	|					ИЗ
	|						ВТТаблицаСоответствия КАК ВТТаблицаСоответствия)
	|				ИЛИ (ПродукцияВЕТИС.ВидПродукции, ВТСырье.ВидПродукции) В
	|					(ВЫБРАТЬ
	|						ВТТаблицаСоответствия.Продукция КАК Продукция,
	|						ВТТаблицаСоответствия.Сырье КАК Сырье
	|					ИЗ
	|						ВТТаблицаСоответствия КАК ВТТаблицаСоответствия)
	|				ИЛИ (ПродукцияВЕТИС.ВидПродукции, ВТСырье.ТипПродукции) В
	|					(ВЫБРАТЬ
	|						ВТТаблицаСоответствия.Продукция КАК Продукция,
	|						ВТТаблицаСоответствия.Сырье КАК Сырье
	|					ИЗ
	|						ВТТаблицаСоответствия КАК ВТТаблицаСоответствия))
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Товары", Товары);
	Запрос.УстановитьПараметр("Сырье" , Сырье.ВыгрузитьКолонку("Продукция"));
	Запрос.УстановитьПараметр("ТаблицаСоответствия", ТаблицаСоответствияПродукцииСырья());
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		ШаблонСообщения = НСтр("ru = 'Продукция с типом ""%1"" не может производиться из сырья с типом ""%2"" (Строка %3)'");
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Товары", Выборка.НомерСтроки, "Продукция");
			
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(ШаблонСообщения, Выборка.ТипПродукцииПредставление, Выборка.ТипСырьяПредставление, Выборка.НомерСтроки),
				ЭтотОбъект,
				Поле,,
				Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТаблицаСоответствияПродукцииСырья()
	
	ТипПродукцияВЕТИС = Новый ОписаниеТипов("СправочникСсылка.ПродукцияВЕТИС");
	ТипИдентификатор = Метаданные.ОпределяемыеТипы.УникальныйИдентификаторИС.Тип;
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Продукция",	ТипПродукцияВЕТИС);
	Результат.Колонки.Добавить("Сырье",		ТипПродукцияВЕТИС);
	
	ТаблицаСоответствияПоИдентификаторам = Новый ТаблицаЗначений;
	ТаблицаСоответствияПоИдентификаторам.Колонки.Добавить("ИдентификаторПродукции",	ТипИдентификатор);
	ТаблицаСоответствияПоИдентификаторам.Колонки.Добавить("ИдентификаторСырья",		ТипИдентификатор);
	
	Макет = Документы.ПроизводственнаяОперацияВЕТИС.ПолучитьМакет("СоответствияПродукцииСырья");
	
	КоличествоСтрок = Макет.ВысотаТаблицы;
	
	Для НомерСтроки = 2 По КоличествоСтрок Цикл
		ИдентификаторПродукции	= СокрЛП(Макет.Область("R" + НомерСтроки + "C2").Текст);
		ИдентификаторСырья		= СокрЛП(Макет.Область("R" + НомерСтроки + "C4").Текст);
		
		НоваяСтрока = ТаблицаСоответствияПоИдентификаторам.Добавить();
		НоваяСтрока.ИдентификаторПродукции	= ИдентификаторПродукции;
		НоваяСтрока.ИдентификаторСырья		= ИдентификаторСырья;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Соответствия.ИдентификаторПродукции КАК ИдентификаторПродукции,
	|	Соответствия.ИдентификаторСырья КАК ИдентификаторСырья
	|ПОМЕСТИТЬ ВТСоответствияПоИдентификаторам
	|ИЗ
	|	&ТаблицаСоответствияПоИдентификаторам КАК Соответствия
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИдентификаторПродукции,
	|	ИдентификаторСырья
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТипыПродукции.Продукция КАК Продукция,
	|	ТипыПродукции.КодТипа КАК КодТипа
	|ПОМЕСТИТЬ ВТТипыПродукции
	|ИЗ
	|	&ТаблицаТипыПродукции КАК ТипыПродукции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСоответствияПоИдентификаторам.ИдентификаторПродукции КАК ИдентификаторПродукции,
	|	ВТСоответствияПоИдентификаторам.ИдентификаторСырья КАК ИдентификаторСырья,
	|	ЕСТЬNULL(ВТТипыПродукции.Продукция, ПродукцияВЕТИС.Ссылка) КАК Продукция,
	|	ЕСТЬNULL(ВТТипыСырья.Продукция, СырьеВЕТИС.Ссылка) КАК Сырье
	|ИЗ
	|	ВТСоответствияПоИдентификаторам КАК ВТСоответствияПоИдентификаторам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПродукцияВЕТИС КАК ПродукцияВЕТИС
	|		ПО ВТСоответствияПоИдентификаторам.ИдентификаторПродукции = ПродукцияВЕТИС.Идентификатор
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПродукцияВЕТИС КАК СырьеВЕТИС
	|		ПО ВТСоответствияПоИдентификаторам.ИдентификаторСырья = СырьеВЕТИС.Идентификатор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТипыПродукции КАК ВТТипыПродукции
	|		ПО ВТСоответствияПоИдентификаторам.ИдентификаторПродукции = ВТТипыПродукции.КодТипа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТипыПродукции КАК ВТТипыСырья
	|		ПО ВТСоответствияПоИдентификаторам.ИдентификаторСырья = ВТТипыСырья.КодТипа
	|ГДЕ
	|	НЕ ЕСТЬNULL(ВТТипыПродукции.Продукция, ПродукцияВЕТИС.Ссылка) ЕСТЬ NULL
	|	И НЕ ЕСТЬNULL(ВТТипыСырья.Продукция, СырьеВЕТИС.Ссылка) ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ТаблицаСоответствияПоИдентификаторам", ТаблицаСоответствияПоИдентификаторам);
	Запрос.УстановитьПараметр("ТаблицаТипыПродукции", ТаблицаТипыПродукции());
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрокаПродукцияСырье(Результат, Выборка.Продукция, Выборка.Сырье);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаТипыПродукции()
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Продукция", Новый ОписаниеТипов("СправочникСсылка.ПродукцияВЕТИС"));
	Результат.Колонки.Добавить("КодТипа", Метаданные.ОпределяемыеТипы.УникальныйИдентификаторИС.Тип);
	
	ТипыПродукции = ПродукцияВЕТИСВызовСервера.ТипыПродукции();
	Для Каждого ТипПродукции Из ТипыПродукции Цикл
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.КодТипа = ТипПродукции.Ключ;
		НоваяСтрока.Продукция = ТипПродукции.Значение;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


Процедура НоваяСтрокаПродукцияСырье(Таблица, Продукция, Сырье)
	
	НоваяСтрока = Таблица.Добавить();
	
	НоваяСтрока.Продукция = Продукция;
	НоваяСтрока.Сырье     = Сырье;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
